      *  1         2         3         4         5         6         7
      *890123456789012345678901234567890123456789012345678901234567890123
      * A  |                         B                                 |
      *------------------------------------------------------------------
      ******************************************
      * プログラム名 : ENSH42
      * 機能 : ファイルのコピー
      ******************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENSHU42.

       